Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/pio/pic32cm5112sg00100.h
#define PIN_PA08B_ADC_ADC0_ANN4                    _UINT32_(8) 
#define MUX_PA08B_ADC_ADC0_ANN4                    _UINT32_(1) 
#define PINMUX_PA08B_ADC_ADC0_ANN4                 ((PIN_PA08B_ADC_ADC0_ANN4 << 16) | MUX_PA08B_ADC_ADC0_ANN4)
#define PORT_PA08B_ADC_ADC0_ANN4                   (_UINT32_(1) << 8)

/* ================== PORT definition for CAN0 peripheral =================== */
#define PIN_PA10H_CAN0_RX                          _UINT32_(10)
#define MUX_PA10H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PA10H_CAN0_RX                       ((PIN_PA10H_CAN0_RX << 16) | MUX_PA10H_CAN0_RX)
#define PORT_PA10H_CAN0_RX                         (_UINT32_(1) << 10)

#define PIN_PC01H_CAN0_RX                          _UINT32_(65)
#define MUX_PC01H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PC01H_CAN0_RX                       ((PIN_PC01H_CAN0_RX << 16) | MUX_PC01H_CAN0_RX)
#define PORT_PC01H_CAN0_RX                         (_UINT32_(1) << 1)

#define PIN_PD06H_CAN0_RX                          _UINT32_(102)
#define MUX_PD06H_CAN0_RX                          _UINT32_(7) 
#define PINMUX_PD06H_CAN0_RX                       ((PIN_PD06H_CAN0_RX << 16) | MUX_PD06H_CAN0_RX)
#define PORT_PD06H_CAN0_RX                         (_UINT32_(1) << 6)

#define PIN_PA11H_CAN0_TX                          _UINT32_(11)
#define MUX_PA11H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PA11H_CAN0_TX                       ((PIN_PA11H_CAN0_TX << 16) | MUX_PA11H_CAN0_TX)
#define PORT_PA11H_CAN0_TX                         (_UINT32_(1) << 11)

#define PIN_PC02H_CAN0_TX                          _UINT32_(66)
#define MUX_PC02H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PC02H_CAN0_TX                       ((PIN_PC02H_CAN0_TX << 16) | MUX_PC02H_CAN0_TX)
#define PORT_PC02H_CAN0_TX                         (_UINT32_(1) << 2)

#define PIN_PD08H_CAN0_TX                          _UINT32_(104)
#define MUX_PD08H_CAN0_TX                          _UINT32_(7) 
#define PINMUX_PD08H_CAN0_TX                       ((PIN_PD08H_CAN0_TX << 16) | MUX_PD08H_CAN0_TX)
#define PORT_PD08H_CAN0_TX                         (_UINT32_(1) << 8)

/* ================== PORT definition for CAN1 peripheral =================== */
#define PIN_PA00H_CAN1_RX                          _UINT32_(0) 
#define MUX_PA00H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PA00H_CAN1_RX                       ((PIN_PA00H_CAN1_RX << 16) | MUX_PA00H_CAN1_RX)
#define PORT_PA00H_CAN1_RX                         (_UINT32_(1) << 0)

#define PIN_PC05H_CAN1_RX                          _UINT32_(69)
#define MUX_PC05H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PC05H_CAN1_RX                       ((PIN_PC05H_CAN1_RX << 16) | MUX_PC05H_CAN1_RX)
#define PORT_PC05H_CAN1_RX                         (_UINT32_(1) << 5)

#define PIN_PD12H_CAN1_RX                          _UINT32_(108)
#define MUX_PD12H_CAN1_RX                          _UINT32_(7) 
#define PINMUX_PD12H_CAN1_RX                       ((PIN_PD12H_CAN1_RX << 16) | MUX_PD12H_CAN1_RX)
#define PORT_PD12H_CAN1_RX                         (_UINT32_(1) << 12)

#define PIN_PA01H_CAN1_TX                          _UINT32_(1) 
#define MUX_PA01H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PA01H_CAN1_TX                       ((PIN_PA01H_CAN1_TX << 16) | MUX_PA01H_CAN1_TX)
#define PORT_PA01H_CAN1_TX                         (_UINT32_(1) << 1)

#define PIN_PC06H_CAN1_TX                          _UINT32_(70)
#define MUX_PC06H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PC06H_CAN1_TX                       ((PIN_PC06H_CAN1_TX << 16) | MUX_PC06H_CAN1_TX)
#define PORT_PC06H_CAN1_TX                         (_UINT32_(1) << 6)

#define PIN_PD13H_CAN1_TX                          _UINT32_(109)
#define MUX_PD13H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PD13H_CAN1_TX                       ((PIN_PD13H_CAN1_TX << 16) | MUX_PD13H_CAN1_TX)
#define PORT_PD13H_CAN1_TX                         (_UINT32_(1) << 13)

/* ================== PORT definition for CCL0 peripheral =================== */
#define PIN_PC12I_CCL0_IN0                         _UINT32_(76)
#define MUX_PC12I_CCL0_IN0                         _UINT32_(8) 
#define PINMUX_PC12I_CCL0_IN0                      ((PIN_PC12I_CCL0_IN0 << 16) | MUX_PC12I_CCL0_IN0)
#define PORT_PC12I_CCL0_IN0                        (_UINT32_(1) << 12)

#define PIN_PC01I_CCL0_IN0                         _UINT32_(65)
#define MUX_PC01I_CCL0_IN0                         _UINT32_(8) 
#define PINMUX_PC01I_CCL0_IN0                      ((PIN_PC01I_CCL0_IN0 << 16) | MUX_PC01I_CCL0_IN0)
#define PORT_PC01I_CCL0_IN0                        (_UINT32_(1) << 1)

#define PIN_PC02I_CCL0_IN1                         _UINT32_(66)
#define MUX_PC02I_CCL0_IN1                         _UINT32_(8) 
#define PINMUX_PC02I_CCL0_IN1                      ((PIN_PC02I_CCL0_IN1 << 16) | MUX_PC02I_CCL0_IN1)
#define PORT_PC02I_CCL0_IN1                        (_UINT32_(1) << 2)

#define PIN_PC14I_CCL0_IN1                         _UINT32_(78)
#define MUX_PC14I_CCL0_IN1                         _UINT32_(8) 
#define PINMUX_PC14I_CCL0_IN1                      ((PIN_PC14I_CCL0_IN1 << 16) | MUX_PC14I_CCL0_IN1)
#define PORT_PC14I_CCL0_IN1                        (_UINT32_(1) << 14)

#define PIN_PC15I_CCL0_IN2                         _UINT32_(79)
#define MUX_PC15I_CCL0_IN2                         _UINT32_(8) 
#define PINMUX_PC15I_CCL0_IN2                      ((PIN_PC15I_CCL0_IN2 << 16) | MUX_PC15I_CCL0_IN2)
#define PORT_PC15I_CCL0_IN2                        (_UINT32_(1) << 15)

#define PIN_PC09I_CCL0_IN2                         _UINT32_(73)
#define MUX_PC09I_CCL0_IN2                         _UINT32_(8) 
#define PINMUX_PC09I_CCL0_IN2                      ((PIN_PC09I_CCL0_IN2 << 16) | MUX_PC09I_CCL0_IN2)
#define PORT_PC09I_CCL0_IN2                        (_UINT32_(1) << 9)

#define PIN_PD00I_CCL0_IN3                         _UINT32_(96)
#define MUX_PD00I_CCL0_IN3                         _UINT32_(8) 
#define PINMUX_PD00I_CCL0_IN3                      ((PIN_PD00I_CCL0_IN3 << 16) | MUX_PD00I_CCL0_IN3)
#define PORT_PD00I_CCL0_IN3                        (_UINT32_(1) << 0)

