Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/pio/pic32cm5112sg00100.h
#define PIN_PD18I_CCL0_IN3                         _UINT32_(114)
#define MUX_PD18I_CCL0_IN3                         _UINT32_(8) 
#define PINMUX_PD18I_CCL0_IN3                      ((PIN_PD18I_CCL0_IN3 << 16) | MUX_PD18I_CCL0_IN3)
#define PORT_PD18I_CCL0_IN3                        (_UINT32_(1) << 18)

#define PIN_PD01I_CCL0_IN4                         _UINT32_(97)
#define MUX_PD01I_CCL0_IN4                         _UINT32_(8) 
#define PINMUX_PD01I_CCL0_IN4                      ((PIN_PD01I_CCL0_IN4 << 16) | MUX_PD01I_CCL0_IN4)
#define PORT_PD01I_CCL0_IN4                        (_UINT32_(1) << 1)

#define PIN_PD17I_CCL0_IN4                         _UINT32_(113)
#define MUX_PD17I_CCL0_IN4                         _UINT32_(8) 
#define PINMUX_PD17I_CCL0_IN4                      ((PIN_PD17I_CCL0_IN4 << 16) | MUX_PD17I_CCL0_IN4)
#define PORT_PD17I_CCL0_IN4                        (_UINT32_(1) << 17)

#define PIN_PD10I_CCL0_IN5                         _UINT32_(106)
#define MUX_PD10I_CCL0_IN5                         _UINT32_(8) 
#define PINMUX_PD10I_CCL0_IN5                      ((PIN_PD10I_CCL0_IN5 << 16) | MUX_PD10I_CCL0_IN5)
#define PORT_PD10I_CCL0_IN5                        (_UINT32_(1) << 10)

#define PIN_PD19I_CCL0_IN5                         _UINT32_(115)
#define MUX_PD19I_CCL0_IN5                         _UINT32_(8) 
#define PINMUX_PD19I_CCL0_IN5                      ((PIN_PD19I_CCL0_IN5 << 16) | MUX_PD19I_CCL0_IN5)
#define PORT_PD19I_CCL0_IN5                        (_UINT32_(1) << 19)

#define PIN_PA00I_CCL0_IN6                         _UINT32_(0) 
#define MUX_PA00I_CCL0_IN6                         _UINT32_(8) 
#define PINMUX_PA00I_CCL0_IN6                      ((PIN_PA00I_CCL0_IN6 << 16) | MUX_PA00I_CCL0_IN6)
#define PORT_PA00I_CCL0_IN6                        (_UINT32_(1) << 0)

#define PIN_PA14I_CCL0_IN6                         _UINT32_(14)
#define MUX_PA14I_CCL0_IN6                         _UINT32_(8) 
#define PINMUX_PA14I_CCL0_IN6                      ((PIN_PA14I_CCL0_IN6 << 16) | MUX_PA14I_CCL0_IN6)
#define PORT_PA14I_CCL0_IN6                        (_UINT32_(1) << 14)

#define PIN_PA01I_CCL0_IN7                         _UINT32_(1) 
#define MUX_PA01I_CCL0_IN7                         _UINT32_(8) 
#define PINMUX_PA01I_CCL0_IN7                      ((PIN_PA01I_CCL0_IN7 << 16) | MUX_PA01I_CCL0_IN7)
#define PORT_PA01I_CCL0_IN7                        (_UINT32_(1) << 1)

#define PIN_PA15I_CCL0_IN7                         _UINT32_(15)
#define MUX_PA15I_CCL0_IN7                         _UINT32_(8) 
#define PINMUX_PA15I_CCL0_IN7                      ((PIN_PA15I_CCL0_IN7 << 16) | MUX_PA15I_CCL0_IN7)
#define PORT_PA15I_CCL0_IN7                        (_UINT32_(1) << 15)

#define PIN_PA10I_CCL0_IN8                         _UINT32_(10)
#define MUX_PA10I_CCL0_IN8                         _UINT32_(8) 
#define PINMUX_PA10I_CCL0_IN8                      ((PIN_PA10I_CCL0_IN8 << 16) | MUX_PA10I_CCL0_IN8)
#define PORT_PA10I_CCL0_IN8                        (_UINT32_(1) << 10)

#define PIN_PA18I_CCL0_IN8                         _UINT32_(18)
#define MUX_PA18I_CCL0_IN8                         _UINT32_(8) 
#define PINMUX_PA18I_CCL0_IN8                      ((PIN_PA18I_CCL0_IN8 << 16) | MUX_PA18I_CCL0_IN8)
#define PORT_PA18I_CCL0_IN8                        (_UINT32_(1) << 18)

#define PIN_PB12I_CCL0_IN9                         _UINT32_(44)
#define MUX_PB12I_CCL0_IN9                         _UINT32_(8) 
#define PINMUX_PB12I_CCL0_IN9                      ((PIN_PB12I_CCL0_IN9 << 16) | MUX_PB12I_CCL0_IN9)
#define PORT_PB12I_CCL0_IN9                        (_UINT32_(1) << 12)

#define PIN_PB05I_CCL0_IN9                         _UINT32_(37)
#define MUX_PB05I_CCL0_IN9                         _UINT32_(8) 
#define PINMUX_PB05I_CCL0_IN9                      ((PIN_PB05I_CCL0_IN9 << 16) | MUX_PB05I_CCL0_IN9)
#define PORT_PB05I_CCL0_IN9                        (_UINT32_(1) << 5)

#define PIN_PB14I_CCL0_IN10                        _UINT32_(46)
#define MUX_PB14I_CCL0_IN10                        _UINT32_(8) 
#define PINMUX_PB14I_CCL0_IN10                     ((PIN_PB14I_CCL0_IN10 << 16) | MUX_PB14I_CCL0_IN10)
#define PORT_PB14I_CCL0_IN10                       (_UINT32_(1) << 14)

#define PIN_PB06I_CCL0_IN10                        _UINT32_(38)
#define MUX_PB06I_CCL0_IN10                        _UINT32_(8) 
#define PINMUX_PB06I_CCL0_IN10                     ((PIN_PB06I_CCL0_IN10 << 16) | MUX_PB06I_CCL0_IN10)
#define PORT_PB06I_CCL0_IN10                       (_UINT32_(1) << 6)

#define PIN_PB15I_CCL0_IN11                        _UINT32_(47)
#define MUX_PB15I_CCL0_IN11                        _UINT32_(8) 
#define PINMUX_PB15I_CCL0_IN11                     ((PIN_PB15I_CCL0_IN11 << 16) | MUX_PB15I_CCL0_IN11)
#define PORT_PB15I_CCL0_IN11                       (_UINT32_(1) << 15)

#define PIN_PB10I_CCL0_IN11                        _UINT32_(42)
#define MUX_PB10I_CCL0_IN11                        _UINT32_(8) 
#define PINMUX_PB10I_CCL0_IN11                     ((PIN_PB10I_CCL0_IN11 << 16) | MUX_PB10I_CCL0_IN11)
#define PORT_PB10I_CCL0_IN11                       (_UINT32_(1) << 10)

#define PIN_PC13I_CCL0_OUT0                        _UINT32_(77)
#define MUX_PC13I_CCL0_OUT0                        _UINT32_(8) 
#define PINMUX_PC13I_CCL0_OUT0                     ((PIN_PC13I_CCL0_OUT0 << 16) | MUX_PC13I_CCL0_OUT0)
#define PORT_PC13I_CCL0_OUT0                       (_UINT32_(1) << 13)

#define PIN_PC03I_CCL0_OUT0                        _UINT32_(67)
#define MUX_PC03I_CCL0_OUT0                        _UINT32_(8) 
#define PINMUX_PC03I_CCL0_OUT0                     ((PIN_PC03I_CCL0_OUT0 << 16) | MUX_PC03I_CCL0_OUT0)
#define PORT_PC03I_CCL0_OUT0                       (_UINT32_(1) << 3)

#define PIN_PD14I_CCL0_OUT1                        _UINT32_(110)
#define MUX_PD14I_CCL0_OUT1                        _UINT32_(8) 
#define PINMUX_PD14I_CCL0_OUT1                     ((PIN_PD14I_CCL0_OUT1 << 16) | MUX_PD14I_CCL0_OUT1)
#define PORT_PD14I_CCL0_OUT1                       (_UINT32_(1) << 14)

#define PIN_PD08I_CCL0_OUT1                        _UINT32_(104)
#define MUX_PD08I_CCL0_OUT1                        _UINT32_(8) 
#define PINMUX_PD08I_CCL0_OUT1                     ((PIN_PD08I_CCL0_OUT1 << 16) | MUX_PD08I_CCL0_OUT1)
#define PORT_PD08I_CCL0_OUT1                       (_UINT32_(1) << 8)

#define PIN_PA02I_CCL0_OUT2                        _UINT32_(2) 
#define MUX_PA02I_CCL0_OUT2                        _UINT32_(8) 
#define PINMUX_PA02I_CCL0_OUT2                     ((PIN_PA02I_CCL0_OUT2 << 16) | MUX_PA02I_CCL0_OUT2)
#define PORT_PA02I_CCL0_OUT2                       (_UINT32_(1) << 2)

#define PIN_PA19I_CCL0_OUT2                        _UINT32_(19)
#define MUX_PA19I_CCL0_OUT2                        _UINT32_(8) 
#define PINMUX_PA19I_CCL0_OUT2                     ((PIN_PA19I_CCL0_OUT2 << 16) | MUX_PA19I_CCL0_OUT2)
#define PORT_PA19I_CCL0_OUT2                       (_UINT32_(1) << 19)

