Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/pio/pic32cm5112sg00100.h
#define PIN_PA13A_EIC_EXTINT13                     _UINT32_(13)
#define MUX_PA13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PA13A_EIC_EXTINT13                  ((PIN_PA13A_EIC_EXTINT13 << 16) | MUX_PA13A_EIC_EXTINT13)
#define PORT_PA13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PA13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PA13 External Interrupt Line */

#define PIN_PC13A_EIC_EXTINT13                     _UINT32_(77)
#define MUX_PC13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PC13A_EIC_EXTINT13                  ((PIN_PC13A_EIC_EXTINT13 << 16) | MUX_PC13A_EIC_EXTINT13)
#define PORT_PC13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PC13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PC13 External Interrupt Line */

#define PIN_PD15A_EIC_EXTINT13                     _UINT32_(111)
#define MUX_PD15A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PD15A_EIC_EXTINT13                  ((PIN_PD15A_EIC_EXTINT13 << 16) | MUX_PD15A_EIC_EXTINT13)
#define PORT_PD15A_EIC_EXTINT13                    (_UINT32_(1) << 15)
#define PIN_PD15A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PD15 External Interrupt Line */

#define PIN_PA14A_EIC_EXTINT14                     _UINT32_(14)
#define MUX_PA14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PA14A_EIC_EXTINT14                  ((PIN_PA14A_EIC_EXTINT14 << 16) | MUX_PA14A_EIC_EXTINT14)
#define PORT_PA14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PA14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PA14 External Interrupt Line */

#define PIN_PB13A_EIC_EXTINT14                     _UINT32_(45)
#define MUX_PB13A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PB13A_EIC_EXTINT14                  ((PIN_PB13A_EIC_EXTINT14 << 16) | MUX_PB13A_EIC_EXTINT14)
#define PORT_PB13A_EIC_EXTINT14                    (_UINT32_(1) << 13)
#define PIN_PB13A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PB13 External Interrupt Line */

#define PIN_PC14A_EIC_EXTINT14                     _UINT32_(78)
#define MUX_PC14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PC14A_EIC_EXTINT14                  ((PIN_PC14A_EIC_EXTINT14 << 16) | MUX_PC14A_EIC_EXTINT14)
#define PORT_PC14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PC14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PC14 External Interrupt Line */

#define PIN_PD16A_EIC_EXTINT14                     _UINT32_(112)
#define MUX_PD16A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PD16A_EIC_EXTINT14                  ((PIN_PD16A_EIC_EXTINT14 << 16) | MUX_PD16A_EIC_EXTINT14)
#define PORT_PD16A_EIC_EXTINT14                    (_UINT32_(1) << 16)
#define PIN_PD16A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PD16 External Interrupt Line */

#define PIN_PA15A_EIC_EXTINT15                     _UINT32_(15)
#define MUX_PA15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PA15A_EIC_EXTINT15                  ((PIN_PA15A_EIC_EXTINT15 << 16) | MUX_PA15A_EIC_EXTINT15)
#define PORT_PA15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PA15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PA15 External Interrupt Line */

#define PIN_PB14A_EIC_EXTINT15                     _UINT32_(46)
#define MUX_PB14A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PB14A_EIC_EXTINT15                  ((PIN_PB14A_EIC_EXTINT15 << 16) | MUX_PB14A_EIC_EXTINT15)
#define PORT_PB14A_EIC_EXTINT15                    (_UINT32_(1) << 14)
#define PIN_PB14A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PB14 External Interrupt Line */

#define PIN_PC15A_EIC_EXTINT15                     _UINT32_(79)
#define MUX_PC15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PC15A_EIC_EXTINT15                  ((PIN_PC15A_EIC_EXTINT15 << 16) | MUX_PC15A_EIC_EXTINT15)
#define PORT_PC15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PC15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PC15 External Interrupt Line */

#define PIN_PD17A_EIC_EXTINT15                     _UINT32_(113)
#define MUX_PD17A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PD17A_EIC_EXTINT15                  ((PIN_PD17A_EIC_EXTINT15 << 16) | MUX_PD17A_EIC_EXTINT15)
#define PORT_PD17A_EIC_EXTINT15                    (_UINT32_(1) << 17)
#define PIN_PD17A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PD17 External Interrupt Line */

#define PIN_PD00A_EIC_NMI                          _UINT32_(96)
#define MUX_PD00A_EIC_NMI                          _UINT32_(0) 
#define PINMUX_PD00A_EIC_NMI                       ((PIN_PD00A_EIC_NMI << 16) | MUX_PD00A_EIC_NMI)
#define PORT_PD00A_EIC_NMI                         (_UINT32_(1) << 0)

/* ================== PORT definition for GCLK peripheral =================== */
#define PIN_PB06K_GCLK_IO0                         _UINT32_(38)
#define MUX_PB06K_GCLK_IO0                         _UINT32_(10)
#define PINMUX_PB06K_GCLK_IO0                      ((PIN_PB06K_GCLK_IO0 << 16) | MUX_PB06K_GCLK_IO0)
#define PORT_PB06K_GCLK_IO0                        (_UINT32_(1) << 6)

#define PIN_PB15K_GCLK_IO0                         _UINT32_(47)
#define MUX_PB15K_GCLK_IO0                         _UINT32_(10)
#define PINMUX_PB15K_GCLK_IO0                      ((PIN_PB15K_GCLK_IO0 << 16) | MUX_PB15K_GCLK_IO0)
#define PORT_PB15K_GCLK_IO0                        (_UINT32_(1) << 15)

#define PIN_PC09K_GCLK_IO0                         _UINT32_(73)
#define MUX_PC09K_GCLK_IO0                         _UINT32_(10)
#define PINMUX_PC09K_GCLK_IO0                      ((PIN_PC09K_GCLK_IO0 << 16) | MUX_PC09K_GCLK_IO0)
#define PORT_PC09K_GCLK_IO0                        (_UINT32_(1) << 9)

#define PIN_PD05K_GCLK_IO0                         _UINT32_(101)
#define MUX_PD05K_GCLK_IO0                         _UINT32_(10)
#define PINMUX_PD05K_GCLK_IO0                      ((PIN_PD05K_GCLK_IO0 << 16) | MUX_PD05K_GCLK_IO0)
#define PORT_PD05K_GCLK_IO0                        (_UINT32_(1) << 5)

