Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/pio/pic32cm5112sg00100.h
#define PIN_PC00P_PTC_DRV19                        _UINT32_(64)
#define MUX_PC00P_PTC_DRV19                        _UINT32_(15)
#define PINMUX_PC00P_PTC_DRV19                     ((PIN_PC00P_PTC_DRV19 << 16) | MUX_PC00P_PTC_DRV19)
#define PORT_PC00P_PTC_DRV19                       (_UINT32_(1) << 0)

#define PIN_PC01P_PTC_DRV20                        _UINT32_(65)
#define MUX_PC01P_PTC_DRV20                        _UINT32_(15)
#define PINMUX_PC01P_PTC_DRV20                     ((PIN_PC01P_PTC_DRV20 << 16) | MUX_PC01P_PTC_DRV20)
#define PORT_PC01P_PTC_DRV20                       (_UINT32_(1) << 1)

#define PIN_PC02P_PTC_DRV21                        _UINT32_(66)
#define MUX_PC02P_PTC_DRV21                        _UINT32_(15)
#define PINMUX_PC02P_PTC_DRV21                     ((PIN_PC02P_PTC_DRV21 << 16) | MUX_PC02P_PTC_DRV21)
#define PORT_PC02P_PTC_DRV21                       (_UINT32_(1) << 2)

#define PIN_PA10P_PTC_DRV22                        _UINT32_(10)
#define MUX_PA10P_PTC_DRV22                        _UINT32_(15)
#define PINMUX_PA10P_PTC_DRV22                     ((PIN_PA10P_PTC_DRV22 << 16) | MUX_PA10P_PTC_DRV22)
#define PORT_PA10P_PTC_DRV22                       (_UINT32_(1) << 10)

#define PIN_PA11P_PTC_DRV23                        _UINT32_(11)
#define MUX_PA11P_PTC_DRV23                        _UINT32_(15)
#define PINMUX_PA11P_PTC_DRV23                     ((PIN_PA11P_PTC_DRV23 << 16) | MUX_PA11P_PTC_DRV23)
#define PORT_PA11P_PTC_DRV23                       (_UINT32_(1) << 11)

#define PIN_PA12P_PTC_DRV24                        _UINT32_(12)
#define MUX_PA12P_PTC_DRV24                        _UINT32_(15)
#define PINMUX_PA12P_PTC_DRV24                     ((PIN_PA12P_PTC_DRV24 << 16) | MUX_PA12P_PTC_DRV24)
#define PORT_PA12P_PTC_DRV24                       (_UINT32_(1) << 12)

#define PIN_PA13P_PTC_DRV25                        _UINT32_(13)
#define MUX_PA13P_PTC_DRV25                        _UINT32_(15)
#define PINMUX_PA13P_PTC_DRV25                     ((PIN_PA13P_PTC_DRV25 << 16) | MUX_PA13P_PTC_DRV25)
#define PORT_PA13P_PTC_DRV25                       (_UINT32_(1) << 13)

#define PIN_PB07P_PTC_DRV26                        _UINT32_(39)
#define MUX_PB07P_PTC_DRV26                        _UINT32_(15)
#define PINMUX_PB07P_PTC_DRV26                     ((PIN_PB07P_PTC_DRV26 << 16) | MUX_PB07P_PTC_DRV26)
#define PORT_PB07P_PTC_DRV26                       (_UINT32_(1) << 7)

#define PIN_PB08P_PTC_DRV27                        _UINT32_(40)
#define MUX_PB08P_PTC_DRV27                        _UINT32_(15)
#define PINMUX_PB08P_PTC_DRV27                     ((PIN_PB08P_PTC_DRV27 << 16) | MUX_PB08P_PTC_DRV27)
#define PORT_PB08P_PTC_DRV27                       (_UINT32_(1) << 8)

#define PIN_PB09P_PTC_DRV28                        _UINT32_(41)
#define MUX_PB09P_PTC_DRV28                        _UINT32_(15)
#define PINMUX_PB09P_PTC_DRV28                     ((PIN_PB09P_PTC_DRV28 << 16) | MUX_PB09P_PTC_DRV28)
#define PORT_PB09P_PTC_DRV28                       (_UINT32_(1) << 9)

#define PIN_PB10P_PTC_DRV29                        _UINT32_(42)
#define MUX_PB10P_PTC_DRV29                        _UINT32_(15)
#define PINMUX_PB10P_PTC_DRV29                     ((PIN_PB10P_PTC_DRV29 << 16) | MUX_PB10P_PTC_DRV29)
#define PORT_PB10P_PTC_DRV29                       (_UINT32_(1) << 10)

#define PIN_PC09P_PTC_DRV30                        _UINT32_(73)
#define MUX_PC09P_PTC_DRV30                        _UINT32_(15)
#define PINMUX_PC09P_PTC_DRV30                     ((PIN_PC09P_PTC_DRV30 << 16) | MUX_PC09P_PTC_DRV30)
#define PORT_PC09P_PTC_DRV30                       (_UINT32_(1) << 9)

#define PIN_PC10P_PTC_DRV31                        _UINT32_(74)
#define MUX_PC10P_PTC_DRV31                        _UINT32_(15)
#define PINMUX_PC10P_PTC_DRV31                     ((PIN_PC10P_PTC_DRV31 << 16) | MUX_PC10P_PTC_DRV31)
#define PORT_PC10P_PTC_DRV31                       (_UINT32_(1) << 10)

#define PIN_PA14P_PTC_DRV32                        _UINT32_(14)
#define MUX_PA14P_PTC_DRV32                        _UINT32_(15)
#define PINMUX_PA14P_PTC_DRV32                     ((PIN_PA14P_PTC_DRV32 << 16) | MUX_PA14P_PTC_DRV32)
#define PORT_PA14P_PTC_DRV32                       (_UINT32_(1) << 14)

#define PIN_PA15P_PTC_DRV33                        _UINT32_(15)
#define MUX_PA15P_PTC_DRV33                        _UINT32_(15)
#define PINMUX_PA15P_PTC_DRV33                     ((PIN_PA15P_PTC_DRV33 << 16) | MUX_PA15P_PTC_DRV33)
#define PORT_PA15P_PTC_DRV33                       (_UINT32_(1) << 15)

#define PIN_PA16P_PTC_DRV34                        _UINT32_(16)
#define MUX_PA16P_PTC_DRV34                        _UINT32_(15)
#define PINMUX_PA16P_PTC_DRV34                     ((PIN_PA16P_PTC_DRV34 << 16) | MUX_PA16P_PTC_DRV34)
#define PORT_PA16P_PTC_DRV34                       (_UINT32_(1) << 16)

#define PIN_PA17P_PTC_DRV35                        _UINT32_(17)
#define MUX_PA17P_PTC_DRV35                        _UINT32_(15)
#define PINMUX_PA17P_PTC_DRV35                     ((PIN_PA17P_PTC_DRV35 << 16) | MUX_PA17P_PTC_DRV35)
#define PORT_PA17P_PTC_DRV35                       (_UINT32_(1) << 17)

#define PIN_PC03P_PTC_ECI0                         _UINT32_(67)
#define MUX_PC03P_PTC_ECI0                         _UINT32_(15)
#define PINMUX_PC03P_PTC_ECI0                      ((PIN_PC03P_PTC_ECI0 << 16) | MUX_PC03P_PTC_ECI0)
#define PORT_PC03P_PTC_ECI0                        (_UINT32_(1) << 3)

#define PIN_PC04P_PTC_ECI1                         _UINT32_(68)
#define MUX_PC04P_PTC_ECI1                         _UINT32_(15)
#define PINMUX_PC04P_PTC_ECI1                      ((PIN_PC04P_PTC_ECI1 << 16) | MUX_PC04P_PTC_ECI1)
#define PORT_PC04P_PTC_ECI1                        (_UINT32_(1) << 4)

#define PIN_PD06P_PTC_PTCXY0                       _UINT32_(102)
#define MUX_PD06P_PTC_PTCXY0                       _UINT32_(15)
#define PINMUX_PD06P_PTC_PTCXY0                    ((PIN_PD06P_PTC_PTCXY0 << 16) | MUX_PD06P_PTC_PTCXY0)
#define PORT_PD06P_PTC_PTCXY0                      (_UINT32_(1) << 6)

