Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/pio/pic32cm5112sg00100.h
#define PIN_PD07P_PTC_PTCXY1                       _UINT32_(103)
#define MUX_PD07P_PTC_PTCXY1                       _UINT32_(15)
#define PINMUX_PD07P_PTC_PTCXY1                    ((PIN_PD07P_PTC_PTCXY1 << 16) | MUX_PD07P_PTC_PTCXY1)
#define PORT_PD07P_PTC_PTCXY1                      (_UINT32_(1) << 7)

#define PIN_PD08P_PTC_PTCXY2                       _UINT32_(104)
#define MUX_PD08P_PTC_PTCXY2                       _UINT32_(15)
#define PINMUX_PD08P_PTC_PTCXY2                    ((PIN_PD08P_PTC_PTCXY2 << 16) | MUX_PD08P_PTC_PTCXY2)
#define PORT_PD08P_PTC_PTCXY2                      (_UINT32_(1) << 8)

#define PIN_PD09P_PTC_PTCXY3                       _UINT32_(105)
#define MUX_PD09P_PTC_PTCXY3                       _UINT32_(15)
#define PINMUX_PD09P_PTC_PTCXY3                    ((PIN_PD09P_PTC_PTCXY3 << 16) | MUX_PD09P_PTC_PTCXY3)
#define PORT_PD09P_PTC_PTCXY3                      (_UINT32_(1) << 9)

#define PIN_PA00P_PTC_PTCXY4                       _UINT32_(0) 
#define MUX_PA00P_PTC_PTCXY4                       _UINT32_(15)
#define PINMUX_PA00P_PTC_PTCXY4                    ((PIN_PA00P_PTC_PTCXY4 << 16) | MUX_PA00P_PTC_PTCXY4)
#define PORT_PA00P_PTC_PTCXY4                      (_UINT32_(1) << 0)

#define PIN_PA01P_PTC_PTCXY5                       _UINT32_(1) 
#define MUX_PA01P_PTC_PTCXY5                       _UINT32_(15)
#define PINMUX_PA01P_PTC_PTCXY5                    ((PIN_PA01P_PTC_PTCXY5 << 16) | MUX_PA01P_PTC_PTCXY5)
#define PORT_PA01P_PTC_PTCXY5                      (_UINT32_(1) << 1)

#define PIN_PA02P_PTC_PTCXY6                       _UINT32_(2) 
#define MUX_PA02P_PTC_PTCXY6                       _UINT32_(15)
#define PINMUX_PA02P_PTC_PTCXY6                    ((PIN_PA02P_PTC_PTCXY6 << 16) | MUX_PA02P_PTC_PTCXY6)
#define PORT_PA02P_PTC_PTCXY6                      (_UINT32_(1) << 2)

#define PIN_PA03P_PTC_PTCXY7                       _UINT32_(3) 
#define MUX_PA03P_PTC_PTCXY7                       _UINT32_(15)
#define PINMUX_PA03P_PTC_PTCXY7                    ((PIN_PA03P_PTC_PTCXY7 << 16) | MUX_PA03P_PTC_PTCXY7)
#define PORT_PA03P_PTC_PTCXY7                      (_UINT32_(1) << 3)

#define PIN_PA04P_PTC_PTCXY8                       _UINT32_(4) 
#define MUX_PA04P_PTC_PTCXY8                       _UINT32_(15)
#define PINMUX_PA04P_PTC_PTCXY8                    ((PIN_PA04P_PTC_PTCXY8 << 16) | MUX_PA04P_PTC_PTCXY8)
#define PORT_PA04P_PTC_PTCXY8                      (_UINT32_(1) << 4)

#define PIN_PA05P_PTC_PTCXY9                       _UINT32_(5) 
#define MUX_PA05P_PTC_PTCXY9                       _UINT32_(15)
#define PINMUX_PA05P_PTC_PTCXY9                    ((PIN_PA05P_PTC_PTCXY9 << 16) | MUX_PA05P_PTC_PTCXY9)
#define PORT_PA05P_PTC_PTCXY9                      (_UINT32_(1) << 5)

#define PIN_PA06P_PTC_PTCXY10                      _UINT32_(6) 
#define MUX_PA06P_PTC_PTCXY10                      _UINT32_(15)
#define PINMUX_PA06P_PTC_PTCXY10                   ((PIN_PA06P_PTC_PTCXY10 << 16) | MUX_PA06P_PTC_PTCXY10)
#define PORT_PA06P_PTC_PTCXY10                     (_UINT32_(1) << 6)

#define PIN_PA07P_PTC_PTCXY11                      _UINT32_(7) 
#define MUX_PA07P_PTC_PTCXY11                      _UINT32_(15)
#define PINMUX_PA07P_PTC_PTCXY11                   ((PIN_PA07P_PTC_PTCXY11 << 16) | MUX_PA07P_PTC_PTCXY11)
#define PORT_PA07P_PTC_PTCXY11                     (_UINT32_(1) << 7)

#define PIN_PA08P_PTC_PTCXY12                      _UINT32_(8) 
#define MUX_PA08P_PTC_PTCXY12                      _UINT32_(15)
#define PINMUX_PA08P_PTC_PTCXY12                   ((PIN_PA08P_PTC_PTCXY12 << 16) | MUX_PA08P_PTC_PTCXY12)
#define PORT_PA08P_PTC_PTCXY12                     (_UINT32_(1) << 8)

#define PIN_PA09P_PTC_PTCXY13                      _UINT32_(9) 
#define MUX_PA09P_PTC_PTCXY13                      _UINT32_(15)
#define PINMUX_PA09P_PTC_PTCXY13                   ((PIN_PA09P_PTC_PTCXY13 << 16) | MUX_PA09P_PTC_PTCXY13)
#define PORT_PA09P_PTC_PTCXY13                     (_UINT32_(1) << 9)

#define PIN_PB00P_PTC_PTCXY14                      _UINT32_(32)
#define MUX_PB00P_PTC_PTCXY14                      _UINT32_(15)
#define PINMUX_PB00P_PTC_PTCXY14                   ((PIN_PB00P_PTC_PTCXY14 << 16) | MUX_PB00P_PTC_PTCXY14)
#define PORT_PB00P_PTC_PTCXY14                     (_UINT32_(1) << 0)

#define PIN_PB03P_PTC_PTCXY15                      _UINT32_(35)
#define MUX_PB03P_PTC_PTCXY15                      _UINT32_(15)
#define PINMUX_PB03P_PTC_PTCXY15                   ((PIN_PB03P_PTC_PTCXY15 << 16) | MUX_PB03P_PTC_PTCXY15)
#define PORT_PB03P_PTC_PTCXY15                     (_UINT32_(1) << 3)

#define PIN_PB04P_PTC_PTCXY16                      _UINT32_(36)
#define MUX_PB04P_PTC_PTCXY16                      _UINT32_(15)
#define PINMUX_PB04P_PTC_PTCXY16                   ((PIN_PB04P_PTC_PTCXY16 << 16) | MUX_PB04P_PTC_PTCXY16)
#define PORT_PB04P_PTC_PTCXY16                     (_UINT32_(1) << 4)

#define PIN_PB05P_PTC_PTCXY17                      _UINT32_(37)
#define MUX_PB05P_PTC_PTCXY17                      _UINT32_(15)
#define PINMUX_PB05P_PTC_PTCXY17                   ((PIN_PB05P_PTC_PTCXY17 << 16) | MUX_PB05P_PTC_PTCXY17)
#define PORT_PB05P_PTC_PTCXY17                     (_UINT32_(1) << 5)

#define PIN_PB06P_PTC_PTCXY18                      _UINT32_(38)
#define MUX_PB06P_PTC_PTCXY18                      _UINT32_(15)
#define PINMUX_PB06P_PTC_PTCXY18                   ((PIN_PB06P_PTC_PTCXY18 << 16) | MUX_PB06P_PTC_PTCXY18)
#define PORT_PB06P_PTC_PTCXY18                     (_UINT32_(1) << 6)

#define PIN_PC00P_PTC_PTCXY19                      _UINT32_(64)
#define MUX_PC00P_PTC_PTCXY19                      _UINT32_(15)
#define PINMUX_PC00P_PTC_PTCXY19                   ((PIN_PC00P_PTC_PTCXY19 << 16) | MUX_PC00P_PTC_PTCXY19)
#define PORT_PC00P_PTC_PTCXY19                     (_UINT32_(1) << 0)

#define PIN_PC01P_PTC_PTCXY20                      _UINT32_(65)
#define MUX_PC01P_PTC_PTCXY20                      _UINT32_(15)
#define PINMUX_PC01P_PTC_PTCXY20                   ((PIN_PC01P_PTC_PTCXY20 << 16) | MUX_PC01P_PTC_PTCXY20)
#define PORT_PC01P_PTC_PTCXY20                     (_UINT32_(1) << 1)

#define PIN_PC02P_PTC_PTCXY21                      _UINT32_(66)
#define MUX_PC02P_PTC_PTCXY21                      _UINT32_(15)
#define PINMUX_PC02P_PTC_PTCXY21                   ((PIN_PC02P_PTC_PTCXY21 << 16) | MUX_PC02P_PTC_PTCXY21)
#define PORT_PC02P_PTC_PTCXY21                     (_UINT32_(1) << 2)

#define PIN_PA10P_PTC_PTCXY22                      _UINT32_(10)
#define MUX_PA10P_PTC_PTCXY22                      _UINT32_(15)
#define PINMUX_PA10P_PTC_PTCXY22                   ((PIN_PA10P_PTC_PTCXY22 << 16) | MUX_PA10P_PTC_PTCXY22)
#define PORT_PA10P_PTC_PTCXY22                     (_UINT32_(1) << 10)

#define PIN_PA11P_PTC_PTCXY23                      _UINT32_(11)
#define MUX_PA11P_PTC_PTCXY23                      _UINT32_(15)
#define PINMUX_PA11P_PTC_PTCXY23                   ((PIN_PA11P_PTC_PTCXY23 << 16) | MUX_PA11P_PTC_PTCXY23)
#define PORT_PA11P_PTC_PTCXY23                     (_UINT32_(1) << 11)

#define PIN_PA12P_PTC_PTCXY24                      _UINT32_(12)
#define MUX_PA12P_PTC_PTCXY24                      _UINT32_(15)
#define PINMUX_PA12P_PTC_PTCXY24                   ((PIN_PA12P_PTC_PTCXY24 << 16) | MUX_PA12P_PTC_PTCXY24)
#define PORT_PA12P_PTC_PTCXY24                     (_UINT32_(1) << 12)

#define PIN_PA13P_PTC_PTCXY25                      _UINT32_(13)
#define MUX_PA13P_PTC_PTCXY25                      _UINT32_(15)
#define PINMUX_PA13P_PTC_PTCXY25                   ((PIN_PA13P_PTC_PTCXY25 << 16) | MUX_PA13P_PTC_PTCXY25)
#define PORT_PA13P_PTC_PTCXY25                     (_UINT32_(1) << 13)

#define PIN_PB07P_PTC_PTCXY26                      _UINT32_(39)
#define MUX_PB07P_PTC_PTCXY26                      _UINT32_(15)
#define PINMUX_PB07P_PTC_PTCXY26                   ((PIN_PB07P_PTC_PTCXY26 << 16) | MUX_PB07P_PTC_PTCXY26)
#define PORT_PB07P_PTC_PTCXY26                     (_UINT32_(1) << 7)

#define PIN_PB08P_PTC_PTCXY27                      _UINT32_(40)
#define MUX_PB08P_PTC_PTCXY27                      _UINT32_(15)
#define PINMUX_PB08P_PTC_PTCXY27                   ((PIN_PB08P_PTC_PTCXY27 << 16) | MUX_PB08P_PTC_PTCXY27)
#define PORT_PB08P_PTC_PTCXY27                     (_UINT32_(1) << 8)

#define PIN_PB09P_PTC_PTCXY28                      _UINT32_(41)
#define MUX_PB09P_PTC_PTCXY28                      _UINT32_(15)
#define PINMUX_PB09P_PTC_PTCXY28                   ((PIN_PB09P_PTC_PTCXY28 << 16) | MUX_PB09P_PTC_PTCXY28)
#define PORT_PB09P_PTC_PTCXY28                     (_UINT32_(1) << 9)

