Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/pio/pic32cm5112sg00100.h
#define PIN_PC13D_SERCOM1_PAD2                     _UINT32_(77)
#define MUX_PC13D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PC13D_SERCOM1_PAD2                  ((PIN_PC13D_SERCOM1_PAD2 << 16) | MUX_PC13D_SERCOM1_PAD2)
#define PORT_PC13D_SERCOM1_PAD2                    (_UINT32_(1) << 13)

#define PIN_PC06D_SERCOM1_PAD2                     _UINT32_(70)
#define MUX_PC06D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PC06D_SERCOM1_PAD2                  ((PIN_PC06D_SERCOM1_PAD2 << 16) | MUX_PC06D_SERCOM1_PAD2)
#define PORT_PC06D_SERCOM1_PAD2                    (_UINT32_(1) << 6)

#define PIN_PD10D_SERCOM1_PAD2                     _UINT32_(106)
#define MUX_PD10D_SERCOM1_PAD2                     _UINT32_(3) 
#define PINMUX_PD10D_SERCOM1_PAD2                  ((PIN_PD10D_SERCOM1_PAD2 << 16) | MUX_PD10D_SERCOM1_PAD2)
#define PORT_PD10D_SERCOM1_PAD2                    (_UINT32_(1) << 10)

#define PIN_PC12D_SERCOM1_PAD3                     _UINT32_(76)
#define MUX_PC12D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PC12D_SERCOM1_PAD3                  ((PIN_PC12D_SERCOM1_PAD3 << 16) | MUX_PC12D_SERCOM1_PAD3)
#define PORT_PC12D_SERCOM1_PAD3                    (_UINT32_(1) << 12)

#define PIN_PC05D_SERCOM1_PAD3                     _UINT32_(69)
#define MUX_PC05D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PC05D_SERCOM1_PAD3                  ((PIN_PC05D_SERCOM1_PAD3 << 16) | MUX_PC05D_SERCOM1_PAD3)
#define PORT_PC05D_SERCOM1_PAD3                    (_UINT32_(1) << 5)

#define PIN_PD11D_SERCOM1_PAD3                     _UINT32_(107)
#define MUX_PD11D_SERCOM1_PAD3                     _UINT32_(3) 
#define PINMUX_PD11D_SERCOM1_PAD3                  ((PIN_PD11D_SERCOM1_PAD3 << 16) | MUX_PD11D_SERCOM1_PAD3)
#define PORT_PD11D_SERCOM1_PAD3                    (_UINT32_(1) << 11)

/* ================= PORT definition for SERCOM2 peripheral ================= */
#define PIN_PC04D_SERCOM2_PAD0                     _UINT32_(68)
#define MUX_PC04D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC04D_SERCOM2_PAD0                  ((PIN_PC04D_SERCOM2_PAD0 << 16) | MUX_PC04D_SERCOM2_PAD0)
#define PORT_PC04D_SERCOM2_PAD0                    (_UINT32_(1) << 4)

#define PIN_PC19D_SERCOM2_PAD0                     _UINT32_(83)
#define MUX_PC19D_SERCOM2_PAD0                     _UINT32_(3) 
#define PINMUX_PC19D_SERCOM2_PAD0                  ((PIN_PC19D_SERCOM2_PAD0 << 16) | MUX_PC19D_SERCOM2_PAD0)
#define PORT_PC19D_SERCOM2_PAD0                    (_UINT32_(1) << 19)

#define PIN_PC18D_SERCOM2_PAD1                     _UINT32_(82)
#define MUX_PC18D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PC18D_SERCOM2_PAD1                  ((PIN_PC18D_SERCOM2_PAD1 << 16) | MUX_PC18D_SERCOM2_PAD1)
#define PORT_PC18D_SERCOM2_PAD1                    (_UINT32_(1) << 18)

#define PIN_PD06D_SERCOM2_PAD1                     _UINT32_(102)
#define MUX_PD06D_SERCOM2_PAD1                     _UINT32_(3) 
#define PINMUX_PD06D_SERCOM2_PAD1                  ((PIN_PD06D_SERCOM2_PAD1 << 16) | MUX_PD06D_SERCOM2_PAD1)
#define PORT_PD06D_SERCOM2_PAD1                    (_UINT32_(1) << 6)

#define PIN_PC17D_SERCOM2_PAD2                     _UINT32_(81)
#define MUX_PC17D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PC17D_SERCOM2_PAD2                  ((PIN_PC17D_SERCOM2_PAD2 << 16) | MUX_PC17D_SERCOM2_PAD2)
#define PORT_PC17D_SERCOM2_PAD2                    (_UINT32_(1) << 17)

#define PIN_PD07D_SERCOM2_PAD2                     _UINT32_(103)
#define MUX_PD07D_SERCOM2_PAD2                     _UINT32_(3) 
#define PINMUX_PD07D_SERCOM2_PAD2                  ((PIN_PD07D_SERCOM2_PAD2 << 16) | MUX_PD07D_SERCOM2_PAD2)
#define PORT_PD07D_SERCOM2_PAD2                    (_UINT32_(1) << 7)

#define PIN_PC16D_SERCOM2_PAD3                     _UINT32_(80)
#define MUX_PC16D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PC16D_SERCOM2_PAD3                  ((PIN_PC16D_SERCOM2_PAD3 << 16) | MUX_PC16D_SERCOM2_PAD3)
#define PORT_PC16D_SERCOM2_PAD3                    (_UINT32_(1) << 16)

#define PIN_PD08D_SERCOM2_PAD3                     _UINT32_(104)
#define MUX_PD08D_SERCOM2_PAD3                     _UINT32_(3) 
#define PINMUX_PD08D_SERCOM2_PAD3                  ((PIN_PD08D_SERCOM2_PAD3 << 16) | MUX_PD08D_SERCOM2_PAD3)
#define PORT_PD08D_SERCOM2_PAD3                    (_UINT32_(1) << 8)

/* ================= PORT definition for SERCOM3 peripheral ================= */
#define PIN_PD16D_SERCOM3_PAD0                     _UINT32_(112)
#define MUX_PD16D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PD16D_SERCOM3_PAD0                  ((PIN_PD16D_SERCOM3_PAD0 << 16) | MUX_PD16D_SERCOM3_PAD0)
#define PORT_PD16D_SERCOM3_PAD0                    (_UINT32_(1) << 16)

#define PIN_PD09D_SERCOM3_PAD0                     _UINT32_(105)
#define MUX_PD09D_SERCOM3_PAD0                     _UINT32_(3) 
#define PINMUX_PD09D_SERCOM3_PAD0                  ((PIN_PD09D_SERCOM3_PAD0 << 16) | MUX_PD09D_SERCOM3_PAD0)
#define PORT_PD09D_SERCOM3_PAD0                    (_UINT32_(1) << 9)

#define PIN_PA00D_SERCOM3_PAD1                     _UINT32_(0) 
#define MUX_PA00D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PA00D_SERCOM3_PAD1                  ((PIN_PA00D_SERCOM3_PAD1 << 16) | MUX_PA00D_SERCOM3_PAD1)
#define PORT_PA00D_SERCOM3_PAD1                    (_UINT32_(1) << 0)

#define PIN_PD15D_SERCOM3_PAD1                     _UINT32_(111)
#define MUX_PD15D_SERCOM3_PAD1                     _UINT32_(3) 
#define PINMUX_PD15D_SERCOM3_PAD1                  ((PIN_PD15D_SERCOM3_PAD1 << 16) | MUX_PD15D_SERCOM3_PAD1)
#define PORT_PD15D_SERCOM3_PAD1                    (_UINT32_(1) << 15)

#define PIN_PA01D_SERCOM3_PAD2                     _UINT32_(1) 
#define MUX_PA01D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PA01D_SERCOM3_PAD2                  ((PIN_PA01D_SERCOM3_PAD2 << 16) | MUX_PA01D_SERCOM3_PAD2)
#define PORT_PA01D_SERCOM3_PAD2                    (_UINT32_(1) << 1)

#define PIN_PD17D_SERCOM3_PAD2                     _UINT32_(113)
#define MUX_PD17D_SERCOM3_PAD2                     _UINT32_(3) 
#define PINMUX_PD17D_SERCOM3_PAD2                  ((PIN_PD17D_SERCOM3_PAD2 << 16) | MUX_PD17D_SERCOM3_PAD2)
#define PORT_PD17D_SERCOM3_PAD2                    (_UINT32_(1) << 17)

#define PIN_PA02D_SERCOM3_PAD3                     _UINT32_(2) 
#define MUX_PA02D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PA02D_SERCOM3_PAD3                  ((PIN_PA02D_SERCOM3_PAD3 << 16) | MUX_PA02D_SERCOM3_PAD3)
#define PORT_PA02D_SERCOM3_PAD3                    (_UINT32_(1) << 2)

#define PIN_PD14D_SERCOM3_PAD3                     _UINT32_(110)
#define MUX_PD14D_SERCOM3_PAD3                     _UINT32_(3) 
#define PINMUX_PD14D_SERCOM3_PAD3                  ((PIN_PD14D_SERCOM3_PAD3 << 16) | MUX_PD14D_SERCOM3_PAD3)
#define PORT_PD14D_SERCOM3_PAD3                    (_UINT32_(1) << 14)

/* ================= PORT definition for SERCOM4 peripheral ================= */
#define PIN_PA03D_SERCOM4_PAD0                     _UINT32_(3) 
#define MUX_PA03D_SERCOM4_PAD0                     _UINT32_(3) 
#define PINMUX_PA03D_SERCOM4_PAD0                  ((PIN_PA03D_SERCOM4_PAD0 << 16) | MUX_PA03D_SERCOM4_PAD0)
#define PORT_PA03D_SERCOM4_PAD0                    (_UINT32_(1) << 3)

#define PIN_PD19D_SERCOM4_PAD0                     _UINT32_(115)
#define MUX_PD19D_SERCOM4_PAD0                     _UINT32_(3) 
#define PINMUX_PD19D_SERCOM4_PAD0                  ((PIN_PD19D_SERCOM4_PAD0 << 16) | MUX_PD19D_SERCOM4_PAD0)
#define PORT_PD19D_SERCOM4_PAD0                    (_UINT32_(1) << 19)

