Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/pic32cm_sg00_curioisty_pro_trustzone/pic32cm_sg00/src/packs/PIC32CM5112SG00100_DFP/pio/pic32cm5112sg00100.h
#define PIN_PA04D_SERCOM4_PAD1                     _UINT32_(4) 
#define MUX_PA04D_SERCOM4_PAD1                     _UINT32_(3) 
#define PINMUX_PA04D_SERCOM4_PAD1                  ((PIN_PA04D_SERCOM4_PAD1 << 16) | MUX_PA04D_SERCOM4_PAD1)
#define PORT_PA04D_SERCOM4_PAD1                    (_UINT32_(1) << 4)

#define PIN_PD20D_SERCOM4_PAD1                     _UINT32_(116)
#define MUX_PD20D_SERCOM4_PAD1                     _UINT32_(3) 
#define PINMUX_PD20D_SERCOM4_PAD1                  ((PIN_PD20D_SERCOM4_PAD1 << 16) | MUX_PD20D_SERCOM4_PAD1)
#define PORT_PD20D_SERCOM4_PAD1                    (_UINT32_(1) << 20)

#define PIN_PA05D_SERCOM4_PAD2                     _UINT32_(5) 
#define MUX_PA05D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PA05D_SERCOM4_PAD2                  ((PIN_PA05D_SERCOM4_PAD2 << 16) | MUX_PA05D_SERCOM4_PAD2)
#define PORT_PA05D_SERCOM4_PAD2                    (_UINT32_(1) << 5)

#define PIN_PD18D_SERCOM4_PAD2                     _UINT32_(114)
#define MUX_PD18D_SERCOM4_PAD2                     _UINT32_(3) 
#define PINMUX_PD18D_SERCOM4_PAD2                  ((PIN_PD18D_SERCOM4_PAD2 << 16) | MUX_PD18D_SERCOM4_PAD2)
#define PORT_PD18D_SERCOM4_PAD2                    (_UINT32_(1) << 18)

#define PIN_PA14D_SERCOM4_PAD3                     _UINT32_(14)
#define MUX_PA14D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PA14D_SERCOM4_PAD3                  ((PIN_PA14D_SERCOM4_PAD3 << 16) | MUX_PA14D_SERCOM4_PAD3)
#define PORT_PA14D_SERCOM4_PAD3                    (_UINT32_(1) << 14)

#define PIN_PA06D_SERCOM4_PAD3                     _UINT32_(6) 
#define MUX_PA06D_SERCOM4_PAD3                     _UINT32_(3) 
#define PINMUX_PA06D_SERCOM4_PAD3                  ((PIN_PA06D_SERCOM4_PAD3 << 16) | MUX_PA06D_SERCOM4_PAD3)
#define PORT_PA06D_SERCOM4_PAD3                    (_UINT32_(1) << 6)

/* ================= PORT definition for SERCOM5 peripheral ================= */
#define PIN_PA16D_SERCOM5_PAD0                     _UINT32_(16)
#define MUX_PA16D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PA16D_SERCOM5_PAD0                  ((PIN_PA16D_SERCOM5_PAD0 << 16) | MUX_PA16D_SERCOM5_PAD0)
#define PORT_PA16D_SERCOM5_PAD0                    (_UINT32_(1) << 16)

#define PIN_PB03D_SERCOM5_PAD0                     _UINT32_(35)
#define MUX_PB03D_SERCOM5_PAD0                     _UINT32_(3) 
#define PINMUX_PB03D_SERCOM5_PAD0                  ((PIN_PB03D_SERCOM5_PAD0 << 16) | MUX_PB03D_SERCOM5_PAD0)
#define PORT_PB03D_SERCOM5_PAD0                    (_UINT32_(1) << 3)

#define PIN_PA17D_SERCOM5_PAD1                     _UINT32_(17)
#define MUX_PA17D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PA17D_SERCOM5_PAD1                  ((PIN_PA17D_SERCOM5_PAD1 << 16) | MUX_PA17D_SERCOM5_PAD1)
#define PORT_PA17D_SERCOM5_PAD1                    (_UINT32_(1) << 17)

#define PIN_PB04D_SERCOM5_PAD1                     _UINT32_(36)
#define MUX_PB04D_SERCOM5_PAD1                     _UINT32_(3) 
#define PINMUX_PB04D_SERCOM5_PAD1                  ((PIN_PB04D_SERCOM5_PAD1 << 16) | MUX_PB04D_SERCOM5_PAD1)
#define PORT_PB04D_SERCOM5_PAD1                    (_UINT32_(1) << 4)

#define PIN_PA18D_SERCOM5_PAD2                     _UINT32_(18)
#define MUX_PA18D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PA18D_SERCOM5_PAD2                  ((PIN_PA18D_SERCOM5_PAD2 << 16) | MUX_PA18D_SERCOM5_PAD2)
#define PORT_PA18D_SERCOM5_PAD2                    (_UINT32_(1) << 18)

#define PIN_PB05D_SERCOM5_PAD2                     _UINT32_(37)
#define MUX_PB05D_SERCOM5_PAD2                     _UINT32_(3) 
#define PINMUX_PB05D_SERCOM5_PAD2                  ((PIN_PB05D_SERCOM5_PAD2 << 16) | MUX_PB05D_SERCOM5_PAD2)
#define PORT_PB05D_SERCOM5_PAD2                    (_UINT32_(1) << 5)

#define PIN_PA15D_SERCOM5_PAD3                     _UINT32_(15)
#define MUX_PA15D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PA15D_SERCOM5_PAD3                  ((PIN_PA15D_SERCOM5_PAD3 << 16) | MUX_PA15D_SERCOM5_PAD3)
#define PORT_PA15D_SERCOM5_PAD3                    (_UINT32_(1) << 15)

#define PIN_PB06D_SERCOM5_PAD3                     _UINT32_(38)
#define MUX_PB06D_SERCOM5_PAD3                     _UINT32_(3) 
#define PINMUX_PB06D_SERCOM5_PAD3                  ((PIN_PB06D_SERCOM5_PAD3 << 16) | MUX_PB06D_SERCOM5_PAD3)
#define PORT_PB06D_SERCOM5_PAD3                    (_UINT32_(1) << 6)

/* ================== PORT definition for TCC0 peripheral =================== */
#define PIN_PA19F_TCC0_WO0                         _UINT32_(19)
#define MUX_PA19F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PA19F_TCC0_WO0                      ((PIN_PA19F_TCC0_WO0 << 16) | MUX_PA19F_TCC0_WO0)
#define PORT_PA19F_TCC0_WO0                        (_UINT32_(1) << 19)

#define PIN_PB11F_TCC0_WO0                         _UINT32_(43)
#define MUX_PB11F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PB11F_TCC0_WO0                      ((PIN_PB11F_TCC0_WO0 << 16) | MUX_PB11F_TCC0_WO0)
#define PORT_PB11F_TCC0_WO0                        (_UINT32_(1) << 11)

#define PIN_PC00F_TCC0_WO0                         _UINT32_(64)
#define MUX_PC00F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PC00F_TCC0_WO0                      ((PIN_PC00F_TCC0_WO0 << 16) | MUX_PC00F_TCC0_WO0)
#define PORT_PC00F_TCC0_WO0                        (_UINT32_(1) << 0)

#define PIN_PA20F_TCC0_WO1                         _UINT32_(20)
#define MUX_PA20F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PA20F_TCC0_WO1                      ((PIN_PA20F_TCC0_WO1 << 16) | MUX_PA20F_TCC0_WO1)
#define PORT_PA20F_TCC0_WO1                        (_UINT32_(1) << 20)

#define PIN_PB12F_TCC0_WO1                         _UINT32_(44)
#define MUX_PB12F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PB12F_TCC0_WO1                      ((PIN_PB12F_TCC0_WO1 << 16) | MUX_PB12F_TCC0_WO1)
#define PORT_PB12F_TCC0_WO1                        (_UINT32_(1) << 12)

#define PIN_PC01F_TCC0_WO1                         _UINT32_(65)
#define MUX_PC01F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PC01F_TCC0_WO1                      ((PIN_PC01F_TCC0_WO1 << 16) | MUX_PC01F_TCC0_WO1)
#define PORT_PC01F_TCC0_WO1                        (_UINT32_(1) << 1)

/* ================== PORT definition for TCC1 peripheral =================== */
#define PIN_PC02F_TCC1_WO0                         _UINT32_(66)
#define MUX_PC02F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PC02F_TCC1_WO0                      ((PIN_PC02F_TCC1_WO0 << 16) | MUX_PC02F_TCC1_WO0)
#define PORT_PC02F_TCC1_WO0                        (_UINT32_(1) << 2)

